Masmiseim36/nxpSDK/boards/mimxrt700evk/edgefast_bluetooth_examples/unicast_media_receiver/cm33_core0/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPinsM2
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitPinsM2(void)
{
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);
    /* Reset IOPCTL2 module */
    RESET_ClearPeripheralReset(kIOPCTL2_RST_SHIFT_RSTn);

    GPIO3->PDDR = ((GPIO3->PDDR &
                    /* Mask bits to zero which are setting */
                    (~(GPIO_PDDR_PDD7_MASK)))

                   /* Port Data Direction: Output */
                   | GPIO_PDDR_PDD7(PDDR_PDD7_pdd1));

    GPIO3->PDOR = ((GPIO3->PDOR &
                    /* Mask bits to zero which are setting */
                    (~(GPIO_PDOR_PDO7_MASK)))

                   /* Port Data Output: Logic level 0 */
                   | GPIO_PDOR_PDO7(PDOR_PDO7_pdo0));

    GPIO7->PDDR = ((GPIO7->PDDR &
                    /* Mask bits to zero which are setting */
                    (~(GPIO_PDDR_PDD23_MASK)))

                   /* Port Data Direction: Output */
                   | GPIO_PDDR_PDD23(PDDR_PDD23_pdd1));

    GPIO7->PDOR = ((GPIO7->PDOR &
                    /* Mask bits to zero which are setting */
                    (~(GPIO_PDOR_PDO23_MASK)))

                   /* Port Data Output: Logic level 0 */
                   | GPIO_PDOR_PDO23(PDOR_PDO23_pdo0));

    const uint32_t WL_RST = (/* Pin is configured as GPIO3_IO7 */
                             IOPCTL_PIO_FUNC0 |
                             /* Disable pull-up / pull-down function */
                             IOPCTL_PIO_PUPD_DI |
                             /* Enable pull-down function */
                             IOPCTL_PIO_PULLDOWN_EN |
                             /* Disable input buffer function */
                             IOPCTL_PIO_INBUF_DI |
                             /* Pseudo Output Drain is disabled */
                             IOPCTL_PIO_PSEDRAIN_DI |
                             /* Input function is not inverted */
                             IOPCTL_PIO_INV_DI |
                             /* Selects transmitter current drive 100ohm */
                             IOPCTL_PIO_DRIVE_100OHM);
    /* PORT3 PIN7 (coords: H7) is configured as GPIO3_IO7 */
    IOPCTL_PinMuxSet(BOARD_INITPINSM2_WL_RST_PORT, BOARD_INITPINSM2_WL_RST_PIN, WL_RST);

    const uint32_t M2_PWREN = (/* Pin is configured as GPIO7_IO23 */
                               IOPCTL_PIO_FUNC0 |
                               /* Disable pull-up / pull-down function */
                               IOPCTL_PIO_PUPD_DI |
                               /* Enable pull-down function */
                               IOPCTL_PIO_PULLDOWN_EN |
                               /* Disable input buffer function */
                               IOPCTL_PIO_INBUF_DI |
                               /* Pseudo Output Drain is disabled */
                               IOPCTL_PIO_PSEDRAIN_DI |
                               /* Input function is not inverted */
                               IOPCTL_PIO_INV_DI |
                               /* Selects transmitter current drive 100ohm */
                               IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN23 (coords: N14) is configured as GPIO7_IO23 */
    IOPCTL_PinMuxSet(BOARD_INITPINSM2_M2_PWREN_PORT, BOARD_INITPINSM2_M2_PWREN_PIN, M2_PWREN);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPinsM2_SDIO:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: L17, peripheral: USDHC1, signal: CLK, pin_signal: PIO7_17, SelectsTransmitterCurrentDrive: O_33, InputBufferEnable: enable, PullSelect: up, PullEnable: enable}
  - {pin_num: L16, peripheral: USDHC1, signal: CMD, pin_signal: PIO7_18, SelectsTransmitterCurrentDrive: O_33, InputBufferEnable: enable, PullSelect: up, PullEnable: enable}
  - {pin_num: M17, peripheral: USDHC1, signal: 'DATA, 0', pin_signal: PIO7_19, SelectsTransmitterCurrentDrive: O_33, InputBufferEnable: enable, PullSelect: up, PullEnable: enable}
  - {pin_num: M18, peripheral: USDHC1, signal: 'DATA, 1', pin_signal: PIO7_20, SelectsTransmitterCurrentDrive: O_33, InputBufferEnable: enable, PullSelect: up, PullEnable: enable}
  - {pin_num: K18, peripheral: USDHC1, signal: 'DATA, 2', pin_signal: PIO7_21, SelectsTransmitterCurrentDrive: O_33, InputBufferEnable: enable, PullSelect: up, PullEnable: enable}
  - {pin_num: K17, peripheral: USDHC1, signal: 'DATA, 3', pin_signal: PIO7_22, SelectsTransmitterCurrentDrive: O_33, InputBufferEnable: enable, PullSelect: up, PullEnable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPinsM2_SDIO
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitPinsM2_SDIO(void)
{
    /* Reset IOPCTL2 module */
    RESET_ClearPeripheralReset(kIOPCTL2_RST_SHIFT_RSTn);

    const uint32_t SDIO_CLK = (/* Pin is configured as USDHC1_CLK */
                               IOPCTL_PIO_FUNC1 |
                               /* Enable pull-up / pull-down function */
                               IOPCTL_PIO_PUPD_EN |
                               /* Enable pull-up function */
                               IOPCTL_PIO_PULLUP_EN |
                               /* Enables input buffer function */
                               IOPCTL_PIO_INBUF_EN |
                               /* Pseudo Output Drain is disabled */
                               IOPCTL_PIO_PSEDRAIN_DI |
                               /* Input function is not inverted */
                               IOPCTL_PIO_INV_DI |
                               /* Selects transmitter current drive 100ohm */
                               IOPCTL_PIO_DRIVE_33OHM);
    /* PORT7 PIN17 (coords: L17) is configured as USDHC1_CLK */
    IOPCTL_PinMuxSet(BOARD_INITPINSM2_SDIO_SDIO_CLK_PORT, BOARD_INITPINSM2_SDIO_SDIO_CLK_PIN, SDIO_CLK);

    const uint32_t SDIO_CMD = (/* Pin is configured as USDHC1_CMD */
                               IOPCTL_PIO_FUNC1 |
                               /* Enable pull-up / pull-down function */
                               IOPCTL_PIO_PUPD_EN |
                               /* Enable pull-up function */
                               IOPCTL_PIO_PULLUP_EN |
                               /* Enables input buffer function */
                               IOPCTL_PIO_INBUF_EN |
                               /* Pseudo Output Drain is disabled */
                               IOPCTL_PIO_PSEDRAIN_DI |
                               /* Input function is not inverted */
                               IOPCTL_PIO_INV_DI |
                               /* Selects transmitter current drive 100ohm */
                               IOPCTL_PIO_DRIVE_33OHM);
    /* PORT7 PIN18 (coords: L16) is configured as USDHC1_CMD */
    IOPCTL_PinMuxSet(BOARD_INITPINSM2_SDIO_SDIO_CMD_PORT, BOARD_INITPINSM2_SDIO_SDIO_CMD_PIN, SDIO_CMD);

    const uint32_t SDIO_D0 = (/* Pin is configured as USDHC1_DATA0 */
                              IOPCTL_PIO_FUNC1 |
                              /* Enable pull-up / pull-down function */
                              IOPCTL_PIO_PUPD_EN |
                              /* Enable pull-up function */
                              IOPCTL_PIO_PULLUP_EN |
                              /* Enables input buffer function */
                              IOPCTL_PIO_INBUF_EN |
                              /* Pseudo Output Drain is disabled */
                              IOPCTL_PIO_PSEDRAIN_DI |
                              /* Input function is not inverted */
                              IOPCTL_PIO_INV_DI |
                              /* Selects transmitter current drive 100ohm */
                              IOPCTL_PIO_DRIVE_33OHM);
    /* PORT7 PIN19 (coords: M17) is configured as USDHC1_DATA0 */
    IOPCTL_PinMuxSet(BOARD_INITPINSM2_SDIO_SDIO_D0_PORT, BOARD_INITPINSM2_SDIO_SDIO_D0_PIN, SDIO_D0);

    const uint32_t SDIO_D1 = (/* Pin is configured as USDHC1_DATA1 */
                              IOPCTL_PIO_FUNC1 |
                              /* Enable pull-up / pull-down function */
                              IOPCTL_PIO_PUPD_EN |
                              /* Enable pull-up function */
                              IOPCTL_PIO_PULLUP_EN |
                              /* Enables input buffer function */
                              IOPCTL_PIO_INBUF_EN |
                              /* Pseudo Output Drain is disabled */
                              IOPCTL_PIO_PSEDRAIN_DI |
                              /* Input function is not inverted */
                              IOPCTL_PIO_INV_DI |
                              /* Selects transmitter current drive 100ohm */
                              IOPCTL_PIO_DRIVE_33OHM);
    /* PORT7 PIN20 (coords: M18) is configured as USDHC1_DATA1 */
    IOPCTL_PinMuxSet(BOARD_INITPINSM2_SDIO_SDIO_D1_PORT, BOARD_INITPINSM2_SDIO_SDIO_D1_PIN, SDIO_D1);

    const uint32_t SDIO_D2 = (/* Pin is configured as USDHC1_DATA2 */
                              IOPCTL_PIO_FUNC1 |
                              /* Enable pull-up / pull-down function */
                              IOPCTL_PIO_PUPD_EN |
                              /* Enable pull-up function */
                              IOPCTL_PIO_PULLUP_EN |
                              /* Enables input buffer function */
                              IOPCTL_PIO_INBUF_EN |
                              /* Pseudo Output Drain is disabled */
                              IOPCTL_PIO_PSEDRAIN_DI |
                              /* Input function is not inverted */
                              IOPCTL_PIO_INV_DI |
                              /* Selects transmitter current drive 100ohm */
                              IOPCTL_PIO_DRIVE_33OHM);
    /* PORT7 PIN21 (coords: K18) is configured as USDHC1_DATA2 */
    IOPCTL_PinMuxSet(BOARD_INITPINSM2_SDIO_SDIO_D2_PORT, BOARD_INITPINSM2_SDIO_SDIO_D2_PIN, SDIO_D2);

    const uint32_t SDIO_D3 = (/* Pin is configured as USDHC1_DATA3 */
                              IOPCTL_PIO_FUNC1 |
                              /* Enable pull-up / pull-down function */
                              IOPCTL_PIO_PUPD_EN |
                              /* Enable pull-up function */
                              IOPCTL_PIO_PULLUP_EN |
                              /* Enables input buffer function */
                              IOPCTL_PIO_INBUF_EN |
                              /* Pseudo Output Drain is disabled */
                              IOPCTL_PIO_PSEDRAIN_DI |
                              /* Input function is not inverted */
                              IOPCTL_PIO_INV_DI |
                              /* Selects transmitter current drive 100ohm */
                              IOPCTL_PIO_DRIVE_33OHM);
    /* PORT7 PIN22 (coords: K17) is configured as USDHC1_DATA3 */
    IOPCTL_PinMuxSet(BOARD_INITPINSM2_SDIO_SDIO_D3_PORT, BOARD_INITPINSM2_SDIO_SDIO_D3_PIN, SDIO_D3);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPinsM2_UARTPins:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: R5, peripheral: LP_FLEXCOMM3, signal: P0, pin_signal: PIO1_18, InputBufferEnable: enable}
  - {pin_num: R4, peripheral: LP_FLEXCOMM3, signal: P1, pin_signal: PIO1_17}
  - {pin_num: P7, peripheral: LP_FLEXCOMM3, signal: P3, pin_signal: PIO1_19, InputBufferEnable: enable}
  - {pin_num: P5, peripheral: LP_FLEXCOMM3, signal: P2, pin_signal: PIO1_16, InputBufferEnable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

