Masmiseim36/nxpSDK/boards/mimxrt700evk/edgefast_bluetooth_examples/unicast_media_receiver/cm33_core0/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPinsM2_UARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitPinsM2_UARTPins(void)
{
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);

    const uint32_t BT_UART_RTS = (/* Pin is configured as LP_FLEXCOMM3_P2 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Disable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_DI |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLDOWN_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT1 PIN16 (coords: P5) is configured as LP_FLEXCOMM3_P2 */
    IOPCTL_PinMuxSet(BOARD_INITPINSM2_UARTPINS_BT_UART_RTS_PORT, BOARD_INITPINSM2_UARTPINS_BT_UART_RTS_PIN, BT_UART_RTS);

    const uint32_t BT_UART_TXD = (/* Pin is configured as LP_FLEXCOMM3_P1 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Disable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_DI |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLDOWN_EN |
                                  /* Disable input buffer function */
                                  IOPCTL_PIO_INBUF_DI |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT1 PIN17 (coords: R4) is configured as LP_FLEXCOMM3_P1 */
    IOPCTL_PinMuxSet(BOARD_INITPINSM2_UARTPINS_BT_UART_TXD_PORT, BOARD_INITPINSM2_UARTPINS_BT_UART_TXD_PIN, BT_UART_TXD);

    const uint32_t BT_UART_RXD = (/* Pin is configured as LP_FLEXCOMM3_P0 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Disable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_DI |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLDOWN_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT1 PIN18 (coords: R5) is configured as LP_FLEXCOMM3_P0 */
    IOPCTL_PinMuxSet(BOARD_INITPINSM2_UARTPINS_BT_UART_RXD_PORT, BOARD_INITPINSM2_UARTPINS_BT_UART_RXD_PIN, BT_UART_RXD);

    const uint32_t BT_UART_CTS = (/* Pin is configured as LP_FLEXCOMM3_P3 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Disable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_DI |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLDOWN_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT1 PIN19 (coords: P7) is configured as LP_FLEXCOMM3_P3 */
    IOPCTL_PinMuxSet(BOARD_INITPINSM2_UARTPINS_BT_UART_CTS_PORT, BOARD_INITPINSM2_UARTPINS_BT_UART_CTS_PIN, BT_UART_CTS);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPinsOctalFlash:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: D16, peripheral: XSPI0, signal: SCLK0_N, pin_signal: PIO6_0, InputBufferEnable: enable, PullSelect: down}
  - {pin_num: D17, peripheral: XSPI0, signal: SCLK0, pin_signal: PIO6_1, InputBufferEnable: enable, PullSelect: down}
  - {pin_num: G11, peripheral: XSPI0, signal: SS0_N, pin_signal: PIO6_2, InputBufferEnable: enable, PullSelect: down}
  - {pin_num: F13, peripheral: XSPI0, signal: 'DATA, 0', pin_signal: PIO6_3, InputBufferEnable: enable, PullSelect: down}
  - {pin_num: D14, peripheral: XSPI0, signal: 'DATA, 1', pin_signal: PIO6_4, InputBufferEnable: enable, PullSelect: down}
  - {pin_num: C15, peripheral: XSPI0, signal: 'DATA, 2', pin_signal: PIO6_5, InputBufferEnable: enable, PullSelect: down}
  - {pin_num: E13, peripheral: XSPI0, signal: 'DATA, 3', pin_signal: PIO6_6, InputBufferEnable: enable, PullSelect: down}
  - {pin_num: D15, peripheral: XSPI0, signal: 'DQS, 0', pin_signal: PIO6_7, InputBufferEnable: enable, PullSelect: down}
  - {pin_num: G13, peripheral: XSPI0, signal: 'DATA, 4', pin_signal: PIO6_8, InputBufferEnable: enable, PullSelect: down}
  - {pin_num: F15, peripheral: XSPI0, signal: 'DATA, 5', pin_signal: PIO6_9, InputBufferEnable: enable, PullSelect: down}
  - {pin_num: E14, peripheral: XSPI0, signal: 'DATA, 6', pin_signal: PIO6_10, InputBufferEnable: enable, PullSelect: down}
  - {pin_num: F14, peripheral: XSPI0, signal: 'DATA, 7', pin_signal: PIO6_11, InputBufferEnable: enable, PullSelect: down}
  - {pin_num: G10, peripheral: XSPI0, signal: SS1_N, pin_signal: PIO6_12, InputBufferEnable: enable, PullSelect: down}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

