Masmiseim36/nxpSDK/boards/mimxrt700evk/edgefast_bluetooth_examples/unicast_media_receiver/cm33_core0/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitCTIMER0Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitCTIMERPins(void)
{
    /* Reset INPUTMUX0 module */
    RESET_ClearPeripheralReset(kINPUTMUX0_RST_SHIFT_RSTn);
    /* Enables the clock for the Input Mux 0 */
    CLOCK_EnableClock(kCLOCK_InputMux);
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);
    /* Selects CTIMER_C_INP10 0 */
    INPUTMUX_AttachSignal(INPUTMUX0, 0U, kINPUTMUX_CtInp10ToTimer0CaptureChannels);
    /* Selects CTIMER_C_INP11 1 */
    INPUTMUX_AttachSignal(INPUTMUX0, 1U, kINPUTMUX_CtInp11ToTimer0CaptureChannels);

    const uint32_t port0_pin6_config = (/* Pin is configured as CTIMER0_CAPTURE0 */
                                        IOPCTL_PIO_FUNC4 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN6 (coords: J5) is configured as CTIMER0_CAPTURE0 */
    IOPCTL_PinMuxSet(0U, 6U, port0_pin6_config);

    const uint32_t port0_pin7_config = (/* Pin is configured as CTIMER0_CAPTURE1 */
                                        IOPCTL_PIO_FUNC4 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Enables input buffer function */
                                        IOPCTL_PIO_INBUF_EN |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN7 (coords: K5) is configured as CTIMER0_CAPTURE1 */
    IOPCTL_PinMuxSet(0U, 7U, port0_pin7_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
